{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "name": "dense_1", "units": 800, "batch_input_shape": [null, 784], "bias_regularizer": null, "dtype": "float32", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "name": "dense_2", "units": 10, "bias_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true}}], "backend": "tensorflow", "keras_version": "2.0.8"}