{"keras_version": "2.0.8", "backend": "tensorflow", "config": [{"config": {"strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "batch_input_shape": [null, 32, 32, 3], "use_bias": true, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null, "filters": 32, "name": "conv2d_1", "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "filters": 32, "name": "conv2d_2", "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "filters": 64, "name": "conv2d_3", "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "filters": 64, "name": "conv2d_4", "trainable": true, "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "bias_constraint": null, "activation": "relu", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 512, "name": "dense_1", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 10, "name": "dense_2", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}